from django.core.management.base import BaseCommand
from core.models import Continent, Federation, Country, Language

# Топ-80 самых распространенных языков мира (без фантастических языков)
LANGUAGES = [
    ("zh", "Китайский"), #+
    ("es", "Испанский"), #+
    ("en", "Английский"), #+
    ("hi", "Хинди"), #+
    ("ar", "Арабский"), #+
    ("pt", "Португальский"), #+
    ("ru", "Русский"), #+
    ("ja", "Японский"), #+
    ("de", "Немецкий"), #+
    ("ko", "Корейский"), #+
    ("vi", "Вьетнамский"), #+
    ("fr", "Французский"), #+
    ("tr", "Турецкий"), #+
    ("it", "Итальянский"), #+
    ("pl", "Польский"), #+
    ("ua", "Украинский"), #+
    ("ro", "Румынский"), #+
    ("nl", "Нидерландский"), #+
    ("bg", "Болгарский"), #+
    ("cs", "Чешский"), #+
    ("sv", "Шведский"), #+
    ("hu", "Венгерский"), #+
    ("el", "Греческий"), #+
    ("az", "Азербайджанский"), #+
    ("kk", "Казахский"), #+
    ("sr", "Сербский"), #+
    ("sk", "Словацкий"), #+
    ("he", "Иврит"), #+
    ("da", "Датский"), #+
    ("fi", "Финский"), #+
    ("no", "Норвежский"), #+
    ("lt", "Литовский"), #+
    ("lv", "Латышский"),#+
    ("et", "Эстонский"), #+
    ("sl", "Словенский"), #+
    ("hr", "Хорватский"), #+
    ("hy", "Армянский"), #+
    ("ka", "Грузинский"), #+
]

class Command(BaseCommand):
    help = "Заполняет базу данных 80 самыми популярными языками мира"

    def handle(self, *args, **kwargs):
        for code, name in LANGUAGES:
            Language.objects.get_or_create(code=code, name=name)
        self.stdout.write(self.style.SUCCESS("Языки успешно добавлены в базу данных!"))
